# Project 2:  Lucid Titanic Sleuthing

## Part 1: Developing an understanding of the data

#### Based on the description of the data you read in the readme describe in your own words this data.

This dataset profiles the passengers on both the Titanic and Lusitania ships.  It gives their survival status, name, age, gender, class, hometown, etc.

#### Based on our conceptual understanding of the columns in this data set.  What are the reasonable range of the values for the Sex, Age, SibSp, Parch columns.

Sex - male or femle
age - <100
SibSp - all numbers are under 10, most closer to 0 than 10
Parch - all numbers are under 10, most closer to 0 than 10

### Open the data in sublime text is there anything that jumps out to you?

In [ ]:
Titanic data seems pretty complete.  Lusitania data has a lot of missing values, and inconsistencies - ie, ages in presumably years and then months, question marks, etc.

## Part 2: reading the data in

#### Now read the data into a Pandas DataFrame

In [230]:
import pandas as pd

import numpy as np
titanic = pd.read_csv("/Users/karibenson/dsi/dsi-workspace/project-02/assets/titanic.csv")
titanic.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [231]:
lusitania = pd.read_csv("/Users/karibenson/dsi/dsi-workspace/project-02/assets/lusitania.csv")
lusitania.head()

,Family name,Title,Personal name,Fate,Age,Department/Class,Passenger/Crew,Citizenship,Position,Status,...,Country,Lifeboat,Rescue Vessel,Body No.,Ticket No.,Cabin No.,Traveling Companions and other notes,Value,Adult/Minor,Sex
0,CAMERON,Mr.,Charles W.,Lost,38,Band,Crew,British,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1,Adult,Male
1,CARR-JONES,Mr.,E.,Lost,37,Band,Crew,British,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1,Adult,Male
2,DRAKEFORD,Mr.,Edward,Saved,30,Band,Crew,British,Violin,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1,Adult,Male
3,HAWKINS,Mr.,Handel,Saved,25,Band,Crew,British,Cello,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1,Adult,Male
4,HEMINGWAY,Mr.,John William,Saved,27,Band,Crew,British,Double Bass,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1,Adult,Male

#### Check that the age column doesn't have any unreasonable values

In [234]:
titanic['age']

0       29.00
1        0.92
2        2.00
3       30.00
4       25.00
5       48.00
6       63.00
7       39.00
8       53.00
9       71.00
10      47.00
11      18.00
12      24.00
13      26.00
14      80.00
15        NaN
16      24.00
17      50.00
18      32.00
19      36.00
20      37.00
21      47.00
22      26.00
23      42.00
24      29.00
25      25.00
26      25.00
27      19.00
28      35.00
29      28.00
        ...
1279    14.00
1280    22.00
1281    22.00
1282      NaN
1283      NaN
1284      NaN
1285    32.50
1286    38.00
1287    51.00
1288    18.00
1289    21.00
1290    47.00
1291      NaN
1292      NaN
1293      NaN
1294    28.50
1295    21.00
1296    27.00
1297      NaN
1298    36.00
1299    27.00
1300    15.00
1301    45.50
1302      NaN
1303      NaN
1304    14.50
1305      NaN
1306    26.50
1307    27.00
1308    29.00
Name: age, dtype: float64

In [235]:
lusitania['Age']

0         38
1         37
2         30
3         25
4         27
5         48
6        NaN
7        NaN
8         24
9       19 ?
10        57
11        50
12       NaN
13       NaN
14       NaN
15       NaN
16       NaN
17       NaN
18       NaN
19       NaN
20       NaN
21       NaN
22       NaN
23        25
24       NaN
25        56
26       NaN
27        41
28       NaN
29       NaN
        ...
1931      44
1932     NaN
1933     NaN
1934     NaN
1935     NaN
1936     NaN
1937      27
1938     NaN
1939     NaN
1940     NaN
1941     NaN
1942      51
1943     NaN
1944      23
1945     NaN
1946     NaN
1947     NaN
1948     NaN
1949     NaN
1950     NaN
1951     NaN
1952     NaN
1953     NaN
1954      31
1955      35
1956     NaN
1957     NaN
1958     NaN
1959      16
1960      37
Name: Age, dtype: object

#### Check for missing values.  How do you know that a value is missing?

In [190]:
titanic['age'].isnull()

0       False
1       False
2       False
3       False
4       False
5       False
6       False
7       False
8       False
9       False
10      False
11      False
12      False
13      False
14      False
15       True
16      False
17      False
18      False
19      False
20      False
21      False
22      False
23      False
24      False
25      False
26      False
27      False
28      False
29      False
        ...
1279    False
1280    False
1281    False
1282     True
1283     True
1284     True
1285    False
1286    False
1287    False
1288    False
1289    False
1290    False
1291     True
1292     True
1293     True
1294    False
1295    False
1296    False
1297     True
1298    False
1299    False
1300    False
1301    False
1302     True
1303     True
1304    False
1305     True
1306    False
1307    False
1308    False
Name: age, dtype: bool

In [191]:
lusitania['Age'].isnull()

0       False
1       False
2       False
3       False
4       False
5       False
6        True
7        True
8       False
9       False
10      False
11      False
12       True
13       True
14       True
15       True
16       True
17       True
18       True
19       True
20       True
21       True
22       True
23      False
24       True
25      False
26       True
27      False
28       True
29       True
        ...
1931    False
1932     True
1933     True
1934     True
1935     True
1936     True
1937    False
1938     True
1939     True
1940     True
1941     True
1942    False
1943     True
1944    False
1945     True
1946     True
1947     True
1948     True
1949     True
1950     True
1951     True
1952     True
1953     True
1954    False
1955    False
1956     True
1957     True
1958     True
1959    False
1960    False
Name: Age, dtype: bool

#### Does it makes sense to guess at the value?

Depends on the value.  We might be able to if we are given other information such as that person's title, travel companions, etc.  We can also look at typical values for other passengers.

## Part 3: data imputation

#### Well let’s say that it does... You likely noticed that Age has some missing values. How many are missing?

In [192]:
#another way - pd.isnull(titanic["age"]).sum()
titanic["age"].isnull().sum()

263

In [193]:
lusitania['Age'].isnull().sum()

653

#### For the Age of the passangers ... how would you guess at the missing values using the other data present in the CSV.
For Titanic, I would determine the mean age and replace the missing values with the mean age.  
For Lusitania, I would first change all of the values (months, ranges) into numeric floats.  I would average all
ages in months or infant to be 1 year since they seem to span from 0 - 2 years.  I would strip all ages with question marks and go with the guessed age.  Anything that is still not a number I would remove from the data set.

In [194]:
titanic['age'].mean()

29.881137667304014

In [195]:
titanic['age'].fillna(30, inplace=True)

In [196]:
lusitania["Age"].unique()

array(['38', '37', '30', '25', '27', '48', nan, '24', '19 ?', '57', '50',
       '56', '41', '19', '33', '29', '18', '20', '21', '26', '17', '58',
       '47', '54', '35', '43', '59', '53', '44', '51', '40', '49', '42',
       '32', '31', '34', '22', '45', '36', '29 ?', '52', '23', '60', '28',
       '16', '46', '15', '39', '63 ?', '55', '64', '53 ?', '09-months',
       '6', '9', '14', '10', '12', '?', '62', '5', '8', '65', '68', '76',
       '61', '63', '03-months', '1.5', '2.5', '18-months', '3', '2',
       '25 ?', '08-months', '4', '15-months', '14-months', 'Infant',
       '3-6-months ?', '51 or 47', '45 or 51', '22 (?)', '17-months',
       '13-months', '02-months', '49 ?', '05-months', '11', '59 (64?)',
       '63 (51?)', '37 (39?)', '32 (22?)', '31 (32?)', '24 (23?)', '27?',
       '7', '42?', '31 ?', '10-months', '38 (?)', '70', '62 (?)',
       '06-months', '13', '2_', '11-months', '30 ?', '34?', '1',
       '39 (47?)', '67', '73', '72', '11-months (3?)', '4.25', '69', '26?',
       '54?', '21?', '16 ?'], dtype=object)

In [197]:
#another method:  lusitania['Age'] = lusitania['Age'].str.replace('.+months.+', '1')
lusitania['Age'] = lusitania['Age'].str.replace('..-months','1')

In [198]:

lusitania['Age'] = lusitania['Age'].str.replace('\?','')

In [199]:
lusitania['Age'] = lusitania['Age'].str.replace('\.+\(.+', '')

In [200]:
lusitania['Age'] = lusitania['Age'].str.replace('Infant','1')

In [201]:
#another method:  lusitania['Age'] = lusitania['Age'].astype(float)
import pandas as pd
import numpy as np
lusitania['Age']=lusitania['Age'].convert_objects(convert_numeric=True)

/Users/karibenson/anaconda/lib/python2.7/site-packages/ipykernel/__main__.py:4: FutureWarning: convert_objects is deprecated.  Use the data-type specific converters pd.to_datetime, pd.to_timedelta and pd.to_numeric.

In [202]:
lusitania['Age'].dropna()

0       38.0
1       37.0
2       30.0
3       25.0
4       27.0
5       48.0
8       24.0
9       19.0
10      57.0
11      50.0
23      25.0
25      56.0
27      41.0
32      19.0
34      33.0
37      50.0
38      29.0
41      38.0
46      18.0
47      20.0
48      21.0
51      26.0
54      17.0
55      33.0
57      27.0
58      25.0
63      24.0
70      58.0
76      18.0
77      26.0
        ...
1847    62.0
1850    43.0
1859    43.0
1860    42.0
1861    40.0
1864    32.0
1865    37.0
1876    45.0
1879    33.0
1881    33.0
1889    53.0
1892    37.0
1895    19.0
1896    35.0
1897    16.0
1900    21.0
1909    55.0
1914    32.0
1916    34.0
1917    16.0
1926    23.0
1927    26.0
1931    44.0
1937    27.0
1942    51.0
1944    23.0
1954    31.0
1955    35.0
1959    16.0
1960    37.0
Name: Age, dtype: float64

I would also change the wording of passenger fate's to match in the two datasets and assign them to numerical values.

In [203]:
lusitania['Fate'] = lusitania['Fate'].str.replace("Lost", "0")
lusitania['Fate'] = lusitania['Fate'].str.replace("Saved", "1")
lusitania['Fate']

0       0
1       0
2       1
3       1
4       1
5       0
6       0
7       1
8       1
9       1
10      0
11      0
12      1
13      1
14      0
15      1
16      1
17      1
18      0
19      1
20      0
21      1
22      0
23      0
24      1
25      1
26      0
27      1
28      1
29      0
       ..
1931    0
1932    0
1933    1
1934    0
1935    1
1936    0
1937    1
1938    0
1939    0
1940    1
1941    1
1942    0
1943    1
1944    1
1945    0
1946    0
1947    0
1948    0
1949    0
1950    1
1951    1
1952    0
1953    0
1954    1
1955    0
1956    1
1957    0
1958    0
1959    1
1960    0
Name: Fate, dtype: object

In [204]:
titanic['deceased'] = titanic['survived'].apply(lambda x: 1 if x==0 else 0)
titanic.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest,deceased
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO",0
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON",0
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON",1
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON",1
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON",1

In [239]:
lusitania['deceased'] = lusitania['Fate'].apply(lambda x: 1 if x=="Lost" else 0)
lusitania['survived'] = lusitania['Fate'].apply(lambda x: 1 if x=="Saved" else 0)
lusitania.head()

,Family name,Title,Personal name,Fate,Age,Department/Class,Passenger/Crew,Citizenship,Position,Status,...,Rescue Vessel,Body No.,Ticket No.,Cabin No.,Traveling Companions and other notes,Value,Adult/Minor,Sex,deceased,survived
0,CAMERON,Mr.,Charles W.,Lost,38,Band,Crew,British,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,1,Adult,Male,1,0
1,CARR-JONES,Mr.,E.,Lost,37,Band,Crew,British,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,1,Adult,Male,1,0
2,DRAKEFORD,Mr.,Edward,Saved,30,Band,Crew,British,Violin,NaN,...,NaN,NaN,NaN,NaN,NaN,1,Adult,Male,0,1
3,HAWKINS,Mr.,Handel,Saved,25,Band,Crew,British,Cello,NaN,...,NaN,NaN,NaN,NaN,NaN,1,Adult,Male,0,1
4,HEMINGWAY,Mr.,John William,Saved,27,Band,Crew,British,Double Bass,NaN,...,NaN,NaN,NaN,NaN,NaN,1,Adult,Male,0,1

I would also want to change gender to a numerical value.

In [205]:
titanic['sex'] = titanic['sex'].str.replace("female", "0")
titanic['sex'] = titanic['sex'].str.replace("male", "1")
titanic['sex']

0       0
1       1
2       0
3       1
4       0
5       1
6       0
7       1
8       0
9       1
10      1
11      0
12      0
13      0
14      1
15      1
16      1
17      0
18      0
19      1
20      1
21      0
22      1
23      0
24      0
25      1
26      1
27      0
28      0
29      1
       ..
1279    0
1280    1
1281    1
1282    1
1283    1
1284    1
1285    1
1286    0
1287    1
1288    1
1289    1
1290    0
1291    1
1292    1
1293    1
1294    1
1295    1
1296    1
1297    1
1298    1
1299    1
1300    0
1301    1
1302    1
1303    1
1304    0
1305    0
1306    1
1307    1
1308    1
Name: sex, dtype: object

In [206]:
lusitania['Sex'] = lusitania['Sex'].str.replace("Female", "0")
lusitania['Sex'] = lusitania['Sex'].str.replace("Male", "1")                                                
lusitania['Sex']

0       1
1       1
2       1
3       1
4       1
5       1
6       1
7       1
8       1
9       1
10      1
11      1
12      1
13      1
14      1
15      1
16      1
17      1
18      1
19      1
20      1
21      1
22      1
23      1
24      1
25      1
26      1
27      1
28      1
29      1
       ..
1931    1
1932    1
1933    1
1934    1
1935    1
1936    1
1937    1
1938    1
1939    1
1940    1
1941    1
1942    0
1943    1
1944    1
1945    1
1946    1
1947    1
1948    1
1949    1
1950    1
1951    1
1952    1
1953    1
1954    1
1955    1
1956    1
1957    1
1958    1
1959    1
1960    1
Name: Sex, dtype: object

# I would also remove the data on people on were not passengers from the Lusitania dataset.  Because Titanic only has information on it's passengers, this makes it possible to compare the two.  I would also convert the labels on the classes of Lusitania's passengers to match the 1, 2, and 3 labels in the Titanic dataset.

In [179]:
set(lusitania['Passenger/Crew'])

{'Crew', 'Passenger', 'Stowaway'}

In [245]:
lusitania['Department/Class'] = lusitania['Department/Class'].str.replace("Saloon", "1")
lusitania['Department/Class'] = lusitania['Department/Class'].str.replace("Second", "2")
lusitania['Department/Class'] = lusitania['Department/Class'].str.replace("Third", "3")

In [242]:

#remove all classes other than 1,2,3

lusitania = lusitania.loc[lusitania['Department/Class'] != 'Third (Distressed British Seaman)']
lusitania = lusitania.loc[lusitania['Department/Class'] != 'Band']
lusitania = lusitania.loc[lusitania['Department/Class'] != 'Deck']
lusitania = lusitania.loc[lusitania['Department/Class'] != 'Engineering']
lusitania = lusitania.loc[lusitania['Department/Class'] != 'Victualling']
lusitania = lusitania.loc[lusitania['Department/Class'] != 'Stowaway']
lusitania['Department/Class'].unique()
#lusitania = lusitania.loc[lusitania['Passenger/Crew'] != 'Stowaway']

array(['Saloon', 'Second', 'Third'], dtype=object)

In [243]:
lusitania['Department/Class'] = lusitania['Department/Class'].convert_objects(convert_numeric=True)

/Users/karibenson/anaconda/lib/python2.7/site-packages/ipykernel/__main__.py:1: FutureWarning: convert_objects is deprecated.  Use the data-type specific converters pd.to_datetime, pd.to_timedelta and pd.to_numeric.
  if __name__ == '__main__':

In [167]:
set(lusitania['Department/Class'])

{1, 2, 3}

In [166]:
titanic["pclass"]

0       1
1       1
2       1
3       1
4       1
5       1
6       1
7       1
8       1
9       1
10      1
11      1
12      1
13      1
14      1
15      1
16      1
17      1
18      1
19      1
20      1
21      1
22      1
23      1
24      1
25      1
26      1
27      1
28      1
29      1
       ..
1279    3
1280    3
1281    3
1282    3
1283    3
1284    3
1285    3
1286    3
1287    3
1288    3
1289    3
1290    3
1291    3
1292    3
1293    3
1294    3
1295    3
1296    3
1297    3
1298    3
1299    3
1300    3
1301    3
1302    3
1303    3
1304    3
1305    3
1306    3
1307    3
1308    3
Name: pclass, dtype: int64

In [30]:
set(titanic['pclass'])

{1, 2, 3}

## Part 4: Group Statistics

#### Are there any groups that were especially adversely affected in the Titanic wreck? (justify your response numerically)

The was the largest difference in survival between the genders, with men having only a 19% chance of survival 
compared to the women's 73%.  Passengers of lower classes also had lower odds of survival than those of the higher,
with only 26% of 3rd class passengers surviving, compared to 43% and 62% in second and first classes respectively.

In [218]:
# total titanic passengers by gender
titanic_female_count = 0
titanic_male_count = 0
for sex in titanic['sex']:
    if sex =='0':
        titanic_female_count += 1
    else:
        titanic_male_count += 1
total_titanic_passengers = titanic_male_count + titanic_female_count      
print titanic_female_count, "females"
print titanic_male_count, "males"
print total_titanic_passengers, "total Titanic passengers"

466 females
843 males
1309 total Titanic passengers

In [31]:
# index goes on y axis, values go on x
Titanic_pivot = pd.pivot_table(titanic, index=["pclass", "sex"], values=["age", "survived", "deceased", "sibsp", "parch", "fare"],
                               aggfunc=[np.sum, np.mean, np.std])
Titanic_pivot

                 sum                                                 mean  \
                 age deceased        fare parch sibsp survived        age
pclass sex
1      0     5256.00        5  15755.3834    68    80      139  36.500000
       1     7035.42      118  12510.0209    50    61       61  39.304022
2      0     2922.42       12   2462.8917    69    53       94  27.570000
       1     5258.83      146   3403.7457    33    56       25  30.753392
3      0     5292.17      110   3310.0379   158   171      106  24.500787
       1    13380.83      418   6108.4073   126   232       75  27.141643

                                                                      std  \
            deceased        fare     parch     sibsp  survived        age
pclass sex
1      0    0.034722  109.412385  0.472222  0.555556  0.965278  13.840247
       1    0.659218   69.888385  0.279330  0.340782  0.340782  13.972946
2      0    0.113208   23.234827  0.650943  0.500000  0.886792  12.732776
       1    0.853801   19.904946  0.192982  0.327485  0.146199  13.434091
3      0    0.509259   15.324250  0.731481  0.791667  0.490741  10.835895
       1    0.847870   12.415462  0.255578  0.470588  0.152130   9.995586


            deceased       fare     parch     sibsp  survived
pclass sex
1      0    0.183714  82.885854  0.774998  0.666667  0.183714
       1    0.475302  74.079427  0.653571  0.541597  0.475302
2      0    0.318352  11.239817  0.862361  0.636209  0.318352
       1    0.354343  14.775149  0.488886  0.551260  0.354343
3      0    0.501076  11.786512  1.262014  1.446126  0.501076
       1    0.359511  11.261638  0.788377  1.218775  0.359511

In [32]:
Titanic_sex_survival_pivot = pd.pivot_table(titanic, index=["sex"], values=["survived", "deceased"], aggfunc=[np.sum, np.mean])
Titanic_sex_survival_pivot

         sum               mean
    deceased survived  deceased  survived
sex
0        127      339  0.272532  0.727468
1        682      161  0.809015  0.190985

In [255]:
import pandas as pd
table2 = pd.crosstab(titanic['sex'], titanic['survived'])
table2
from scipy.stats import chi2_contingency
chisq_value, pvalue_gender_income, df, expected = chi2_contingency(table2)
chisq_value, df

(363.61790843882488, 1)

In [256]:
Titanic_class_pivot = pd.pivot_table(titanic, index=["pclass"], values=["survived", "deceased"], aggfunc=[np.sum, np.mean])
Titanic_class_pivot

            sum      mean
       survived  survived
pclass
1           200  0.619195
2           119  0.429603
3           181  0.255289

In [44]:
import pandas as pd
table = pd.crosstab(titanic['pclass'], titanic['survived'])
table
from scipy.stats import chi2_contingency
chisq_value, pvalue_gender_income, df, expected = chi2_contingency(table)
chisq_value, df

(127.85915643930326, 2)

#### Are there any groups that outperformed the survival of the latter group? (justify your response numerically)

In [ ]:
The biggest deciding factor effecting survival was gender.  Overall, almost 73% of women survived.
The second highest factor was class, with first class having the best odds.
Passengers who were of both categories - first class and female - had the best odds, with over 96% of them
surviving the disaster.

## Part 5:  Comparative Statistics:  Lusitania

In [224]:
# total Lusitania passengers by gender
lusitania_female_count = 0
lusitania_male_count = 0
for sex in lusitania['Sex']:
    if sex =='0':
        lusitania_female_count += 1
    else:
        lusitania_male_count += 1
total_lusitania_passengers = lusitania_male_count + lusitania_female_count      
print lusitania_female_count, "females"
print lusitania_male_count, "males"
print total_lusitania_passengers, "total Lusitania passengers"

518 females
1443 males
1961 total Lusitania passengers

#### Are there any groups that were especially adversely affected in the Lusitania wreck? (justify your response numerically)

In [247]:
Lusitania_pivot = pd.pivot_table(lusitania, index=["Department/Class", "Sex"], values=["Age", "survived", "deceased"],
                               aggfunc=[np.sum, np.mean, np.std])
Lusitania_pivot

                             sum               mean                 std  \
                        deceased survived  deceased  survived  deceased
Department/Class Sex
1                Female       56       34  0.615385  0.373626  0.489200
                 Male        121       78  0.605000  0.390000  0.490077
2                Female      185      108  0.629252  0.367347  0.483829
                 Male        187      119  0.609121  0.387622  0.488744
3                Female       68       40  0.629630  0.370370  0.485155
                 Male        168       94  0.641221  0.358779  0.480560


                         survived
Department/Class Sex
1                Female  0.486446
                 Male    0.488974
2                Female  0.482904
                 Male    0.488003
3                Female  0.485155
                 Male    0.480560

In [249]:
Lusitania_sex_survival_pivot = pd.pivot_table(lusitania, index=["Sex"], values=["survived", "deceased"], aggfunc=[np.sum, np.mean])
Lusitania_sex_survival_pivot

            sum               mean
       deceased survived  deceased  survived
Sex
Female      309      182  0.626775  0.369168
Male        476      291  0.618986  0.378414

In [261]:
import pandas as pd
table3 = pd.crosstab(lusitania['Sex'], lusitania['survived'])
table3
from scipy.stats import chi2_contingency
chisq_value, pvalue_gender_income, df, expected = chi2_contingency(table3)
chisq_value, df

(0.073675226466345889, 1)

In [257]:
Lusitania_class_pivot = pd.pivot_table(lusitania, index=["Department/Class"], values=["survived", "deceased"], aggfunc=[np.sum, np.mean])
Lusitania_class_pivot

                      sum               mean
                 deceased survived  deceased  survived
Department/Class
1                     177      112  0.608247  0.384880
2                     372      227  0.618968  0.377704
3                     236      134  0.637838  0.362162

In [262]:
import pandas as pd
table4 = pd.crosstab(lusitania['Department/Class'], lusitania['survived'])
table4
from scipy.stats import chi2_contingency
chisq_value, pvalue_gender_income, df, expected = chi2_contingency(table4)
chisq_value, df

(0.39999129037096409, 2)

#### Are there any groups that outperformed the survival of the latter group? (justify your response numerically)

In [ ]:
The survival rate on the Lusitania is very similar across gender and classes.

#### What does the group-wise survival rate imply about circumstances during these two accidents?

The large chi-squared values for the Titanic indicate that we must reject the null hypothesis that survival was independent of any other variables.  Conversely, with the Lusitania, we can accept the null hypothesis.